In [ ]:
"""
Given a table

drop table if exists actor;
CREATE TABLE actor (
   actor_id  smallint(5)  NOT NULL PRIMARY KEY,
   first_name  varchar(45) NOT NULL,
   last_name  varchar(45) NOT NULL,
   last_update  DATETIME NOT NULL);
insert into actor values ('3', 'WD', 'GUINESS', '2006-02-15 12:34:33');

Insert the following data, ignore if it alraedy exists
3	'ED'	'CHASE'	'2006-02-15 12:34:33'
3, 'WD', 'GUINESS', '2006-02-15 12:34:33'
"""

In [ ]:
"""SQL solution"""
INSERT IGNORE INTO actor
VALUES
(3,	'ED', 'CHASE', '2006-02-15 12:34:33'),
(3, 'WD', 'GUINESS', '2006-02-15 12:34:33')

In [27]:
"""pandas dataframe creation"""
import pandas as pd
actor = pd.DataFrame([[3, 'WD', 'GUINESS', '2006-02-15 12:34:33']], columns=['actor_id', 'first_name', 'last_name', 'last_update'])
actor

   actor_id first_name last_name          last_update
0         3         WD   GUINESS  2006-02-15 12:34:33

In [6]:
# concat the existing dataframe and the new dataframe with data to be inserted
# then drop duplicates
df = pd.DataFrame([[3,	'ED', 'CHASE', '2006-02-15 12:34:33'],
                   [3, 'WD', 'GUINESS', '2006-02-15 12:34:33']],
                  columns=['actor_id', 'first_name', 'last_name', 'last_update'])
pd.concat([actor, df]).drop_duplicates()

   actor_id first_name last_name          last_update
0         3         WD   GUINESS  2006-02-15 12:34:33
0         3         ED     CHASE  2006-02-15 12:34:33

In [7]:
# notice that we have duplicates for indices, reset index
pd.concat([actor, df]).drop_duplicates().reset_index()

   index  actor_id first_name last_name          last_update
0      0         3         WD   GUINESS  2006-02-15 12:34:33
1      0         3         ED     CHASE  2006-02-15 12:34:33

In [22]:
"""compare if row or column exists"""
df = pd.DataFrame([[0,1],[2,3],[4,5]], columns=['A', 'B'])
a = [2, 3]
print(df)
df == a

   A  B
0  0  1
1  2  3
2  4  5

       A      B
0  False  False
1   True   True
2  False  False

In [23]:
# check if the column values are all equal
(df == a).all() # (df == a).all(0)

A    False
B    False
dtype: bool

In [24]:
# check if the row values are all equal
(df == a).all(1)

0    False
1     True
2    False
dtype: bool

In [28]:
# check if the row alrady exists 
# insert row by row at the end of the existing dataframe (or any locatioin given by loc)
new_data = [[3,	'ED', 'CHASE', '2006-02-15 12:34:33'],
            [3, 'WD', 'GUINESS', '2006-02-15 12:34:33']]

for i in range(len(new_data)):
    if not (actor == new_data[i]).all(1).any():
        actor.loc[len(actor)] = new_data[i] # add the new row at loc len(actor), which is below the last row of the current dataframe
actor

   actor_id first_name last_name          last_update
0         3         WD   GUINESS  2006-02-15 12:34:33
1         3         ED     CHASE  2006-02-15 12:34:33